{"keras_version": "2.1.1", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "trainable": true, "input_dim": 98, "dtype": "float32", "input_length": 64, "embeddings_regularizer": null, "batch_input_shape": [null, 64], "output_dim": 128, "name": "embedding_1"}}, {"class_name": "CuDNNGRU", "config": {"bias_regularizer": null, "return_state": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 512, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dtype": "float32", "recurrent_regularizer": null, "name": "cu_dnngru_1", "return_sequences": true, "stateful": false, "batch_input_shape": [null, 128], "recurrent_constraint": null, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "name": "dropout_1", "trainable": true, "seed": null}}, {"class_name": "CuDNNGRU", "config": {"bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "stateful": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "recurrent_regularizer": null, "return_state": false, "return_sequences": true, "name": "cu_dnngru_2", "recurrent_constraint": null, "units": 256, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "name": "dropout_2", "trainable": true, "seed": null}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "layer": {"class_name": "Dense", "config": {"bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "units": 98, "kernel_constraint": null, "name": "dense_1", "use_bias": true, "trainable": true, "bias_constraint": null}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}]}