{"keras_version": "2.1.2", "backend": "tensorflow", "config": [{"config": {"embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "name": "embedding_1", "trainable": true, "output_dim": 128, "batch_input_shape": [null, 128], "dtype": "float32", "mask_zero": false, "activity_regularizer": null, "embeddings_regularizer": null, "input_dim": 99, "input_length": 128, "embeddings_constraint": null}, "class_name": "Embedding"}, {"config": {"return_sequences": true, "dtype": "float32", "recurrent_constraint": null, "name": "cu_dnnlstm_1", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "batch_input_shape": [null, 128], "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_regularizer": null, "go_backwards": false, "return_state": false, "units": 512, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "CuDNNLSTM"}, {"config": {"noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.05, "seed": null}, "class_name": "Dropout"}, {"config": {"return_sequences": true, "recurrent_constraint": null, "name": "cu_dnnlstm_2", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "return_state": false, "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "activity_regularizer": null, "recurrent_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "units": 128, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "CuDNNLSTM"}, {"config": {"noise_shape": null, "trainable": true, "name": "dropout_2", "rate": 0.3, "seed": null}, "class_name": "Dropout"}, {"config": {"layer": {"config": {"activation": "linear", "name": "dense_1", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 99, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, "name": "time_distributed_1", "trainable": true}, "class_name": "TimeDistributed"}, {"config": {"activation": "softmax", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}