{"keras_version": "2.1.1", "config": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "mask_zero": false, "trainable": true, "batch_input_shape": [null, 64], "name": "embedding_1", "output_dim": 128, "input_dim": 98, "embeddings_constraint": null, "input_length": 64}}, {"class_name": "CuDNNGRU", "config": {"stateful": false, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "return_state": false, "dtype": "float32", "name": "cu_dnngru_1", "bias_constraint": null, "activity_regularizer": null, "units": 512, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "go_backwards": false, "bias_regularizer": null, "recurrent_regularizer": null, "batch_input_shape": [null, 128], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "return_sequences": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true, "rate": 0.5}}, {"class_name": "CuDNNGRU", "config": {"stateful": false, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "return_state": false, "bias_constraint": null, "activity_regularizer": null, "units": 256, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "go_backwards": false, "bias_regularizer": null, "recurrent_regularizer": null, "name": "cu_dnngru_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "return_sequences": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "seed": null, "trainable": true, "rate": 0.5}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "units": 98, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "class_name": "Sequential", "backend": "tensorflow"}