{"class_name": "Sequential", "keras_version": "2.0.9", "backend": "tensorflow", "config": [{"class_name": "Embedding", "config": {"dtype": "float32", "embeddings_regularizer": null, "name": "embedding_1", "embeddings_constraint": null, "activity_regularizer": null, "mask_zero": false, "input_dim": 98, "batch_input_shape": [null, 64], "output_dim": 128, "trainable": true, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "input_length": 64}}, {"class_name": "CuDNNLSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 640, "stateful": false, "kernel_regularizer": null, "bias_constraint": null, "name": "cu_dnnlstm_1", "unit_forget_bias": true, "bias_regularizer": null, "activity_regularizer": null, "return_state": false, "dtype": "float32", "recurrent_regularizer": null, "batch_input_shape": [null, 128], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "recurrent_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.4, "seed": null, "noise_shape": null}}, {"class_name": "CuDNNLSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 256, "stateful": false, "kernel_regularizer": null, "bias_constraint": null, "name": "cu_dnnlstm_2", "unit_forget_bias": true, "bias_regularizer": null, "activity_regularizer": null, "return_state": false, "recurrent_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.4, "seed": null, "noise_shape": null}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "layer": {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 98, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}]}