{"config": [{"config": {"input_dim": 98, "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "trainable": true, "dtype": "float32", "mask_zero": false, "output_dim": 128, "name": "embedding_2", "embeddings_constraint": null, "embeddings_regularizer": null, "input_length": 64, "activity_regularizer": null, "batch_input_shape": [null, 64]}, "class_name": "Embedding"}, {"config": {"go_backwards": false, "trainable": true, "stateful": false, "dtype": "float32", "kernel_regularizer": null, "recurrent_regularizer": null, "return_sequences": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "cu_dnnlstm_3", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "units": 256, "batch_input_shape": [null, 128], "activity_regularizer": null, "recurrent_constraint": null, "kernel_constraint": null, "return_state": false, "bias_constraint": null}, "class_name": "CuDNNLSTM"}, {"config": {"noise_shape": null, "seed": null, "name": "dropout_3", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"go_backwards": false, "trainable": true, "stateful": false, "kernel_regularizer": null, "recurrent_regularizer": null, "return_sequences": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "cu_dnnlstm_4", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "units": 256, "activity_regularizer": null, "recurrent_constraint": null, "kernel_constraint": null, "return_state": false, "bias_constraint": null}, "class_name": "CuDNNLSTM"}, {"config": {"noise_shape": null, "seed": null, "name": "dropout_4", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"layer": {"config": {"kernel_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 98, "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}, "name": "time_distributed_2", "trainable": true}, "class_name": "TimeDistributed"}, {"config": {"activation": "softmax", "name": "activation_2", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.1.1", "class_name": "Sequential", "backend": "tensorflow"}