{"backend": "theano", "config": [{"config": {"output_dim": 30, "batch_input_shape": [null, 64], "embeddings_constraint": null, "dtype": "float32", "embeddings_regularizer": null, "activity_regularizer": null, "name": "embedding_1", "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "input_dim": 75, "input_length": 64, "trainable": true, "mask_zero": false}, "class_name": "Embedding"}, {"config": {"kernel_constraint": null, "return_state": false, "batch_input_shape": [null, 30], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "dtype": "float32", "kernel_regularizer": null, "implementation": 2, "bias_regularizer": null, "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null, "recurrent_regularizer": null, "stateful": false, "trainable": true, "use_bias": true, "go_backwards": false, "return_sequences": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "units": 256, "recurrent_dropout": 0.001, "dropout": 0.001, "activity_regularizer": null, "name": "lstm_1", "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"rate": 0.01, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "return_state": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "unroll": false, "kernel_regularizer": null, "implementation": 2, "bias_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null, "recurrent_regularizer": null, "stateful": false, "trainable": true, "use_bias": true, "go_backwards": false, "return_sequences": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "units": 256, "recurrent_dropout": 0.001, "dropout": 0.001, "activity_regularizer": null, "name": "lstm_2", "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"rate": 0.01, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "time_distributed_1", "layer": {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 75, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "dense_1", "trainable": true, "use_bias": true}, "class_name": "Dense"}, "trainable": true}, "class_name": "TimeDistributed"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.0.8"}