{"keras_version": "2.0.8", "config": [{"config": {"embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_dim": 75, "mask_zero": false, "name": "embedding_1", "embeddings_regularizer": null, "input_length": 64, "dtype": "float32", "trainable": true, "embeddings_constraint": null, "output_dim": 30, "batch_input_shape": [null, 64], "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"return_state": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "recurrent_constraint": null, "kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "implementation": 2, "batch_input_shape": [null, 30], "dropout": 0.001, "units": 256, "recurrent_regularizer": null, "bias_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.001, "activity_regularizer": null, "activation": "tanh", "return_sequences": true, "trainable": true, "bias_constraint": null, "unit_forget_bias": true, "name": "lstm_1", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.01}, "class_name": "Dropout"}, {"config": {"return_state": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "recurrent_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "implementation": 2, "go_backwards": false, "dropout": 0.001, "units": 256, "recurrent_regularizer": null, "bias_regularizer": null, "recurrent_dropout": 0.001, "activity_regularizer": null, "activation": "tanh", "return_sequences": true, "trainable": true, "bias_constraint": null, "unit_forget_bias": true, "name": "lstm_2", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.01}, "class_name": "Dropout"}, {"config": {"name": "time_distributed_1", "trainable": true, "layer": {"config": {"bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "units": 75, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}}, "class_name": "TimeDistributed"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "backend": "theano", "class_name": "Sequential"}